Revit 2026 API
NumberingSchemaTypes.StructuralNumberingSchemas Class
 A collection of types of built-in Numbering Schemas that are used for numbering structure elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class StructuralNumberingSchemas
Public NotInheritable Class StructuralNumberingSchemas
public ref class StructuralNumberingSchemas abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralNumberingSchemas = class end
The NumberingSchemaTypes.StructuralNumberingSchemas type exposes the following members.
Properties
Name | Description
Rebar |  Built-in schema used for numbering rebar elements
RebarCoupler |  Built-in schema used for numbering rebar coupler elements
ReinforcementFabric |  Built-in schema used for numbering fabric reinforcement elements
Top
See Also
Reference
Autodesk.Revit.DB Namespace